0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 275;

boundaryField
{
    inlet
    {
        type        fixedValue;
        value       uniform 275;
    }

    outlet
    {
        type        zeroGradient;
    }

    walls
    {
        type        fixedValue;
        value       uniform 275;
    }

    fan
    {
        type        fixedValue;
        value       uniform 500;
    }

    "AMI1|AMI2"
    {
        type            cyclicAMI;
        valeu           uniform 275;
    }
}

// ************************************************************************* //
